Revit 2026 API

# BuiltInFailuresMultiReferenceAnnotationFailures Class

---

Failures about MultiReferenceAnnotations.

SystemObject Autodesk.Revit.DBBuiltInFailuresMultiReferenceAnnotationFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MultiReferenceAnnotationFailures
```
```vb
Public NotInheritable Class MultiReferenceAnnotationFailures
```
```cpp
public ref class MultiReferenceAnnotationFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MultiReferenceAnnotationFailures = class end
```

The BuiltInFailuresMultiReferenceAnnotationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementCategoryChangeInvalidatesMultiReferenceAnnotation | Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted. |
|  | MultiReferenceAnnotationReferenceCategoryForcesDeletion | Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references. |

#### Reference

Autodesk.Revit.DB Namespace